---
kind: property
id: P:Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.SegmentLengthDimensionTextPosition
source: html/d6917842-00a8-7fbf-8217-0840b38d3a16.htm
---
# Autodesk.Revit.DB.Structure.BendingDetailCustomFieldProperties.SegmentLengthDimensionTextPosition Property

Identifies the text position with respect to dimension line.

## Syntax (C#)
```csharp
public BendingDetailDimensionTextPosition SegmentLengthDimensionTextPosition { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration